#include <stdio.h> // เรียกใช้ไลบรารีมาตรฐานสำหรับการแสดงผลและรับค่าทางหน้าจอ

int main() {
    // ประกาศตัวแปรเก็บชื่อ อายุ และส่วนสูง
    char name[30] = "K";          // ตัวแปรเก็บชื่อแบบข้อความ 
    int age = 18;                 // ตัวแปรเก็บอายุ 
    float height = 185.1;         // ตัวแปรเก็บส่วนสูง (จำนวนทศนิยม)

    // ประกาศตัวแปรเก็บชื่อวิชา เกรด และสัญลักษณ์แทนเกรด
    char subject = 'C';           // ตัวแปรเก็บชื่อวิชา 
    float grade = 3.60;           // ตัวแปรเก็บเกรด (ทศนิยม 2 ตำแหน่ง)
    char symbol = 'A';            // ตัวแปรเก็บสัญลักษณ์แทนเกรด 

    // แสดงผลชื่อ อายุ และส่วนสูง
    printf("%s is %d years old and %.1f centimeters tall.\n", name, age, height);
    // %s ใช้แสดงข้อความ
    // %d ใช้แสดงจำนวนเต็ม 
    // %.1f ใช้แสดงทศนิยม 1 ตำแหน่ง

    // แสดงผลวิชา เกรด และตัวอักษรแทนเกรด
    printf("In subject %c, %s got %.2f which is symbolized as '%c'.\n", subject, name, grade, symbol);
    // %c ใช้แสดงตัวอักษร
    // %.2f ใช้แสดงทศนิยม 2 ตำแหน่ง
    // มีการใช้ ' ' เพื่อใส่สัญลักษณ์ให้ดูเด่นขึ้น

    return 0; // จบโปรเเกรม
}