#include <stdio.h>  // ใช้ไลบรารีมาตรฐาน เพื่อใช้ฟังก์ชัน printf สำหรับแสดงผล

int main() {  // ฟังก์ชันหลักของโปรแกรม เริ่มต้นการทำงานจากตรงนี้

    // บรรทัดที่ 1 แสดงข้อความ a = 0 . 6 1 7 %
    // ใช้ %% เพื่อให้แสดงเครื่องหมาย % จริงๆ
    printf("a = 0 . 6 1 7 %%\n");

    // บรรทัดที่ 2 แสดงข้อความ b =   2   5 %
    // ระยะห่างของช่องว่างจัดตามตาราง เพื่อให้ตรงตำแหน่ง
    printf("b =   2   5 %%\n");

    // บรรทัดที่ 3 แสดงข้อความ c = 1 9 . 0 0 0 %
    // มีการแสดงตัวเลข พร้อมจุดทศนิยม และมีช่องว่างแทรก
    printf("c = 1 9 . 0 0 0 %%\n");

    // บรรทัดที่ 4 แสดงข้อความ d   =   9 %
    // ชื่อตัวแปร d มีช่องว่าง 3 ช่องก่อนถึงเครื่องหมายเท่ากับ และช่องว่างอีก 3 ก่อนเลข 9
    printf("d   =   9 %%\n");

    // บรรทัดที่ 5 แสดงข้อความ e = 1 2 4 . 5 5 5 %
    // มีการจัดเรียงตัวเลขหลายหลักเเละจุดและ %
    printf("e = 1 2 4 . 5 5 5 %%\n");

    // บรรทัดที่ 6 แสดงข้อความ f = 0 . 0 0 1 %
    // มีตัวเลขและจุดจัดตามตำแหน่ง โดยมี % ปิดท้าย
    printf("f = 0 . 0 0 1 %%\n");

    return 0;  // คืนค่า จบโปรเเกรม
}

